Revit 2027 API
ExportIFCCategoryInfo.IFCEntityName Property
 The name of the IFC entity mapped to a particular Revit category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IFCEntityName { get; set; }
Public Property IFCEntityName As String
	Get
	Set
public:
property String^ IFCEntityName {
	String^ get ();
	void set (String^ value);
}
member IFCEntityName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportIFCCategoryInfo Class
Autodesk.Revit.DB Namespace